# IFrameworkElementCreator Methods

---
The IFrameworkElementCreator type exposes the following members.
| Name| Description
---|---|---
| CreateFrameworkElement|  Method called to create the FrameworkElement.
Top
#### Reference
IFrameworkElementCreator Interface
Autodesk.Revit.UI Namespace